In [1]:
import pandas as pd
import numpy as np

**Tipos de dados**

Os tipos de dados, ou dtypes, no Pandas são fundamentais para trabalhar com dados de forma eficiente e precisa. Cada coluna em um DataFrame pode conter um tipo específico de dados, como números inteiros, números de ponto flutuante, strings, datas, entre outros.

Os principais tipos de dados no Pandas incluem:

1. *int64*: Números inteiros;
2. *float64*: Números de ponto flutuante (decimais);
3. *object*: Strings ou objetos;
4. *datetime64*: Datas e horários;
5. *bool*: Valores booleanos (True/False);
6. *category*: Dados categóricos.

In [3]:
dados ={
    'Inteiro': [1, 2, 3, 4],
    'Float': [1.1, 2.2, 3.3, 4.4],
    'String': ['a', 'b', 'c', 'd'],
    'Data': pd.to_datetime(['2021-01-01', '2021-02-01', '2021-03-01', '2021-04-01']),
    'Booleano': [True, False, True, False],
    'Categoria': pd.Categorical(['fruta', 'vegetal', 'fruta', 'vegetal'])
}
df = pd.DataFrame(dados)
print("Dataframe de exemplo:")
display(df)

Dataframe de exemplo:

   Inteiro  Float String       Data  Booleano Categoria
0        1    1.1      a 2021-01-01      True     fruta
1        2    2.2      b 2021-02-01     False   vegetal
2        3    3.3      c 2021-03-01      True     fruta
3        4    4.4      d 2021-04-01     False   vegetal

In [4]:
print("Tipos de dados do Dataframe:")
print(df.dtypes)

Tipos de dados do Dataframe:
Inteiro               int64
Float               float64
String               object
Data         datetime64[ns]
Booleano               bool
Categoria          category
dtype: object

In [5]:
#Se quiser ver o tipo de dados de uma coluna use dtype
print(df.String.dtype)

object

Tipos de dados numéricos: **int64** e **float64**

In [6]:
#Verificando os tipos de dados
print("Tipo de dado da coluna 'Inteiro':", df.Inteiro.dtype)
print("Tipo de dado da coluna 'Float':", df['Float'].dtype)

Tipo de dado da coluna 'Inteiro': int64
Tipo de dado da coluna 'Float': float64

Tipo de dado de texto: **object**

In [7]:
#Verificando o tipo de dado
print("Tipo de dado da coluna 'String':", df['String'].dtype)

Tipo de dado da coluna 'String': object

Tipo de dado de data e hora: **datetime64**

In [8]:
#Verificando o tipo de dado
print("Tipo de dado da coluna 'Data':", df.Data.dtype)

Tipo de dado da coluna 'Data': datetime64[ns]

Tipo de dado booleano: **bool**

In [9]:
#Verificando o tipo de dado
print("Tipo de dado da coluna 'Booleano':", df['Booleano'].dtype)

Tipo de dado da coluna 'Booleano': bool

Tipo de dado categórico: **category**

In [10]:
#Verificando o tipo de dado
print("Tipo de dado da coluna 'Categoria':", df['Categoria'].dtype)

Tipo de dado da coluna 'Categoria': category

Convertendo tipos de dados

**Exemplo: convertendo inteiro *int64* para *float64***

In [12]:
#Convertendo inteiro para float
df['Inteiro'] = df['Inteiro'].astype(float)
print("Dataframe após conversão da coluna 'Inteiro' de int64 para float64:")
display(df)

Dataframe após conversão da coluna 'Inteiro' de int64 para float64:

   Inteiro  Float String       Data  Booleano Categoria
0      1.0    1.1      a 2021-01-01      True     fruta
1      2.0    2.2      b 2021-02-01     False   vegetal
2      3.0    3.3      c 2021-03-01      True     fruta
3      4.0    4.4      d 2021-04-01     False   vegetal

**Valores ausentes: dados nulos e/ou faltantes**

Para identificar dados nulos em um DataFrame, usamos métodos como isnull() e notnull(), que retornam um DataFrame de valores booleanos indicando a presença de valores nulos

In [13]:
#Criando um dataframe de exemplo com valores nulos
dados2 = {
    'Nome': ['Ana', 'Bruno', 'Carlos', None, 'Eduardo'],
    'Idade': [23, None, 45, 29, None],
    'Cidade': ['São Paulo', 'Rio de Janeiro', None, 'Curitiba', 'Porto Alegre'],
    'Nota': [85, 90, 78, None, 88]
}
df2 = pd.DataFrame(dados2)
print("Dataframe de exemplo com valores nulos:")
display(df2)

Dataframe de exemplo com valores nulos:

      Nome  Idade          Cidade  Nota
0      Ana   23.0       São Paulo  85.0
1    Bruno    NaN  Rio de Janeiro  90.0
2   Carlos   45.0            None  78.0
3     None   29.0        Curitiba   NaN
4  Eduardo    NaN    Porto Alegre  88.0

Identificação de valores nulos e ausentes

In [14]:
#Verificando se há valores nulos
display(df2.isnull())
print("Contagem de valores nulos em cada coluna:")
display(df2.isnull().sum())

    Nome  Idade  Cidade   Nota
0  False  False   False  False
1  False   True   False  False
2  False  False    True  False
3   True  False   False   True
4  False   True   False  False

Contagem de valores nulos em cada coluna:

Nome      1
Idade     2
Cidade    1
Nota      1
dtype: int64

Tratamento de dados nulos e ausentes

Existem várias maneiras de tratar dados nulos e ausentes/faltantes, dependendo da situação e dos requisitos do seu projeto.

**1. Remoção de dados nulos**

In [15]:
#Removendo linhas com qualquer valor nulo
df_sem_nulos_linhas = df2.dropna()
print("Dataframe sem linhas com valores nulos:")
display(df_sem_nulos_linhas)

Dataframe sem linhas com valores nulos:

  Nome  Idade     Cidade  Nota
0  Ana   23.0  São Paulo  85.0

In [16]:
#Removendo colunas com qualquer valor nulo
df_sem_nulos_colunas = df2.dropna(axis=1)
print("Dataframe sem colunas com valores nulos:")
display(df_sem_nulos_colunas)

Dataframe sem colunas com valores nulos:

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

**2. Preenchimento de dados nulos**

Preenchimento com um valor específico

In [17]:
#Preenchendo valores nulos com 0 (zero)
df_preenchido_zero = df2.fillna(0)
print("Preenchendo valores nulos com zero:")
display(df_preenchido_zero)

Preenchendo valores nulos com zero:

      Nome  Idade          Cidade  Nota
0      Ana   23.0       São Paulo  85.0
1    Bruno    0.0  Rio de Janeiro  90.0
2   Carlos   45.0               0  78.0
3        0   29.0        Curitiba   0.0
4  Eduardo    0.0    Porto Alegre  88.0